<script setup lang="ts">
import { Swiper, SwiperSlide } from 'swiper/vue'
import { Navigation, Pagination, Scrollbar } from 'swiper/modules'
import 'swiper/css'
import 'swiper/css/navigation'
import 'swiper/css/pagination'
import 'swiper/css/scrollbar'

import { computed, onMounted, ref } from 'vue'
const modules = [Navigation, Pagination, Scrollbar]
const onSwiper = (swiper: any) => {
  console.log(swiper)
}
const onSlideChange = () => {
  console.log('slide change')
}
const prevEl = ref<HTMLElement | null>(null)
const nextEl = ref<HTMLElement | null>(null)
const navigation = computed(() => ({
  prevEl: prevEl.value,
  nextEl: nextEl.value,
  disabledClass: 'swiper-button-disabled',
}))
onMounted(() => {
  navigation.value.prevEl = prevEl.value
  navigation.value.nextEl = nextEl.value
})
const commentsData = ref([
  {
    id: crypto.randomUUID,
    name: 'Екатерина Константинопольская',
    text: 'Это восторг!😍 19.10.2022 г. мы провели свою свадьбу в ресторане Hotel на Пушкина.  Увидела рекламу ресторана в интернете, решили приехать, посмотреть локацию. Сначала сомневалась, стоит ли устраивать свадьбу в отеле, да еще и на 4 этаже, боялась, что не сможем как следует повеселиться, пошуметь, короче отметить с размахом. НО! Как только мы приехали на место, все сомнения вообще отпали! Администратор Мария, очень милая девушка все объяснила, рассказала и показала. Шумоизоляция тут отличная, есть вообще все удобства на этаже, даже выходить никуда не надо! И очень крутой вид! Особенно вечером… ',
    img: '',
  },
  {
    id: crypto.randomUUID,
    name: 'Екатерина Константинопольская',
    text: 'Это восторг!😍 19.10.2022 г. мы провели свою свадьбу в ресторане Hotel на Пушкина.  Увидела рекламу ресторана в интернете, решили приехать, посмотреть локацию. Сначала сомневалась, стоит ли устраивать свадьбу в отеле, да еще и на 4 этаже, боялась, что не сможем как следует повеселиться, пошуметь, короче отметить с размахом. НО! Как только мы приехали на место, все сомнения вообще отпали! Администратор Мария, очень милая девушка все объяснила, рассказала и показала. Шумоизоляция тут отличная, есть вообще все удобства на этаже, даже выходить никуда не надо! И очень крутой вид! Особенно вечером… ',
    img: '',
  },
  {
    id: crypto.randomUUID,
    name: 'Екатерина Константинопольская',
    text: 'Это восторг!😍 19.10.2022 г. мы провели свою свадьбу в ресторане Hotel на Пушкина.  Увидела рекламу ресторана в интернете, решили приехать, посмотреть локацию. Сначала сомневалась, стоит ли устраивать свадьбу в отеле, да еще и на 4 этаже, боялась, что не сможем как следует повеселиться, пошуметь, короче отметить с размахом. НО! Как только мы приехали на место, все сомнения вообще отпали! Администратор Мария, очень милая девушка все объяснила, рассказала и показала. Шумоизоляция тут отличная, есть вообще все удобства на этаже, даже выходить никуда не надо! И очень крутой вид! Особенно вечером… ',
    img: '',
  },
  {
    id: crypto.randomUUID,
    name: 'Екатерина Константинопольская',
    text: 'Это восторг!😍 19.10.2022 г. мы провели свою свадьбу в ресторане Hotel на Пушкина.  Увидела рекламу ресторана в интернете, решили приехать, посмотреть локацию. Сначала сомневалась, стоит ли устраивать свадьбу в отеле, да еще и на 4 этаже, боялась, что не сможем как следует повеселиться, пошуметь, короче отметить с размахом. НО! Как только мы приехали на место, все сомнения вообще отпали! Администратор Мария, очень милая девушка все объяснила, рассказала и показала. Шумоизоляция тут отличная, есть вообще все удобства на этаже, даже выходить никуда не надо! И очень крутой вид! Особенно вечером… ',
    img: '',
  },
  {
    id: crypto.randomUUID,
    name: 'Екатерина Константинопольская',
    text: 'Это восторг!😍 19.10.2022 г. мы провели свою свадьбу в ресторане Hotel на Пушкина.  Увидела рекламу ресторана в интернете, решили приехать, посмотреть локацию. Сначала сомневалась, стоит ли устраивать свадьбу в отеле, да еще и на 4 этаже, боялась, что не сможем как следует повеселиться, пошуметь, короче отметить с размахом. НО! Как только мы приехали на место, все сомнения вообще отпали! Администратор Мария, очень милая девушка все объяснила, рассказала и показала. Шумоизоляция тут отличная, есть вообще все удобства на этаже, даже выходить никуда не надо! И очень крутой вид! Особенно вечером… ',
    img: '',
  },
  {
    id: crypto.randomUUID,
    name: 'Екатерина Константинопольская',
    text: 'Это восторг!😍 19.10.2022 г. мы провели свою свадьбу в ресторане Hotel на Пушкина.  Увидела рекламу ресторана в интернете, решили приехать, посмотреть локацию. Сначала сомневалась, стоит ли устраивать свадьбу в отеле, да еще и на 4 этаже, боялась, что не сможем как следует повеселиться, пошуметь, короче отметить с размахом. НО! Как только мы приехали на место, все сомнения вообще отпали! Администратор Мария, очень милая девушка все объяснила, рассказала и показала. Шумоизоляция тут отличная, есть вообще все удобства на этаже, даже выходить никуда не надо! И очень крутой вид! Особенно вечером… ',
    img: '',
  },
  {
    id: crypto.randomUUID,
    name: 'Екатерина Константинопольская',
    text: 'Это восторг!😍 19.10.2022 г. мы провели свою свадьбу в ресторане Hotel на Пушкина.  Увидела рекламу ресторана в интернете, решили приехать, посмотреть локацию. Сначала сомневалась, стоит ли устраивать свадьбу в отеле, да еще и на 4 этаже, боялась, что не сможем как следует повеселиться, пошуметь, короче отметить с размахом. НО! Как только мы приехали на место, все сомнения вообще отпали! Администратор Мария, очень милая девушка все объяснила, рассказала и показала. Шумоизоляция тут отличная, есть вообще все удобства на этаже, даже выходить никуда не надо! И очень крутой вид! Особенно вечером… ',
    img: '',
  },
])
</script>

<template>
  <div class="feedback__wrapper">
    <div class="feedback__countainer">
      <div class="feedback__navigation-buttons">
        <h1>Отзывы о нас</h1>
        <div class="navigation-buttons">
          <button ref="prevEl" class="custom-prev">
            <img src="@/assets/image/Arrow.svg" alt="" />
          </button>
          <button ref="nextEl" class="custom-next">
            <img src="@/assets/image/Arrow.svg" style="rotate: 180deg" alt="" />
          </button>
        </div>
      </div>
      <div class="feedback__countainer__swiper">
        <swiper
          :modules="modules"
          slides-per-view="auto"
          :space-between="24"
          :navigation="navigation"
          :pagination="{
            clickable: true,
            el: '.custom-pagination',
            type: 'bullets',
            bulletClass: 'custom-bullet',
            bulletActiveClass: 'custom-bullet-active',
          }"
          @swiper="onSwiper"
          @slideChange="onSlideChange"
        >
          <swiper-slide v-for="comment in commentsData" :key="comment.id">
            <div class="slide-content">
              <img src="@/assets/image/Fed_photo.png" alt="photo" />
              <div class="slide-content__text">
                <h3>{{ comment.name }}</h3>
                <p>{{ comment.text }}</p>
              </div>
            </div>
          </swiper-slide>
        </swiper>
      </div>
    </div>
  </div>
</template>

<style scoped lang="scss">
.feedback__wrapper {
  max-width: 1588px;

  margin: 0 auto;
  margin-top: 60px;
  height: 476px;

  @media (max-width: 700px) {
    height: 432px;
    margin-top: 30px;
  }

  .feedback__countainer {
    
    width: 100%;
    height: 100%;
    border-radius: 16px;
    background: $lightGreyV2;
    padding: 20px;
    .feedback__navigation-buttons {
      padding-top: 25px;
      display: flex;
      gap: 48px;
      margin-bottom: 30px;
      align-items: center;
      @media (max-width: 700px) {
        gap: 85px;
      }
      h1 {
        @include text40;
        font-weight: bold;
        @media (max-width: 700px) {
          @include text20;
        }
      }
      .navigation-buttons {
        display: flex;
        gap: 20px;
        background: none;
        border: none;
        font: inherit;
        cursor: pointer;
        .custom-prev,
        .custom-next {
          display: flex;
          justify-content: center;
          align-items: center;
          background: $goldV2;
          height: 52px;
          width: 52px;
          border: none;
          border-radius: 100%;
        }
      }
    }

    .custom-pagination {
      display: flex;
      justify-content: center;
      gap: 8px;
      margin-top: 40px;

      .custom-bullet {
        width: 12px;
        height: 12px;
        border-radius: 50%;
        background: #d9d9d9;
        cursor: pointer;
        transition: all 0.3s;

        &-active {
          background: $goldV2;
          width: 24px;
          border-radius: 6px;
        }
      }
    }
    :deep(.swiper-button-prev),
    :deep(.swiper-button-next) {
      display: none;
    }

    :deep(.swiper-pagination) {
      display: none;
    }

    .feedback__countainer__swiper {
      .swiper {
        overflow: visible;
        .swiper-slide {
          width: 520px;
          @media (max-width: 700px) {
            width: 270px;
          }
        }
      }

      .slide-content {
        box-shadow: 0px 8px 16px rgba($color: #222324, $alpha: 0.1);
        height: 280px;
        background: white;
        padding: 20px;
        border-radius: 8px;
        display: flex;
        gap: 24px;
        @media (max-width: 700px) {
          flex-direction: column;
        }

        img {
          width: 72px;
          height: 72px;
          border-radius: 16px;
        }
        .slide-content__text {
          display: flex;
          flex-direction: column;
          gap: 8px;
          h3 {
            @include text20;
            font-weight: bold;
          }
          p {
            @include text14;
            color: $inputTextV2;
            display: -webkit-box;
            -webkit-line-clamp: 9;
            -webkit-box-orient: vertical;
            overflow: hidden;
            text-overflow: ellipsis;
            @media (max-width: 700px) {
              -webkit-line-clamp: 5;
            }
          }
        }
      }
    }
  }
}
</style>
